In [7]:
from pandas import Series, DataFrame
import pandas as pd

In [8]:
fruitSeries = Series([2500, 3800, 1200, 6000],
                     index=['apple', 'banana', 'peer', 'cherry'])
fruitData = {'fruitName':['apple','banana','cherry','peer'],
             'fruitPrice':[2500,3800,6000,1200],
             'num':[10,5,3,8]}
fruitFrame =DataFrame(fruitData, columns = ['fruitPrice', 'num', 'fruitName'])

print(fruitSeries)
print(fruitFrame)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64
   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      peer

In [4]:
fruitSeries.values

array([2500, 3800, 1200, 6000], dtype=int64)

In [5]:
fruitSeries.keys

<bound method Series.keys of apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64>

In [9]:
fruitFrame['year'] = 2016
print(fruitFrame)

   fruitPrice  num fruitName  year
0        2500   10     apple  2016
1        3800    5    banana  2016
2        6000    3    cherry  2016
3        1200    8      peer  2016

In [10]:
fruitFrame['stock'] = Series([4, 2, 1], index=[0, 2, 3])
print(fruitFrame)

   fruitPrice  num fruitName  year  stock
0        2500   10     apple  2016    4.0
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      peer  2016    1.0

In [13]:
new_fruitSeries = fruitSeries.drop('banana', inplace=False)
print(fruitSeries)
print(new_fruitSeries)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64
apple     2500
peer      1200
cherry    6000
dtype: int64

In [20]:
new_fruitFrame = fruitFrame.drop([0])
new_fruitFrame

   fruitPrice  num fruitName  year  stock
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      peer  2016    1.0

In [21]:
new_new_fruitFrame = fruitFrame.drop('stock', axis=1)
print(fruitFrame)
print(new_new_fruitFrame)

   fruitPrice  num fruitName  year  stock
0        2500   10     apple  2016    4.0
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      peer  2016    1.0
   fruitPrice  num fruitName  year
0        2500   10     apple  2016
1        3800    5    banana  2016
2        6000    3    cherry  2016
3        1200    8      peer  2016

In [23]:
fruitFrame[1:3]

   fruitPrice  num fruitName  year  stock
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0

In [26]:
fruitFrame['fruitPrice']

0    2500
1    3800
2    6000
3    1200
Name: fruitPrice, dtype: int64

In [27]:
fruitFrame[['fruitPrice']]

   fruitPrice
0        2500
1        3800
2        6000
3        1200

In [25]:
fruitFrame[['fruitPrice', 'num']]

   fruitPrice  num
0        2500   10
1        3800    5
2        6000    3
3        1200    8

In [28]:
fruit1 = Series([5,9,10,3],index = ['apple','banana','cherry','peer'])
fruit2 = Series([3,2,9,5,10],index = ['apple','orange','banana','cherry','mango'])
print(fruit1)
print(fruit2)
fruit1 + fruit2

apple      5
banana     9
cherry    10
peer       3
dtype: int64
apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

In [29]:
fruitData1 = {'Ohio' : [4,8,3,5],'Texas' : [0,1,2,3]}
fruitFrame1 = DataFrame(fruitData1,columns=['Ohio','Texas'],index = ['apple','banana','cherry','peer'])
fruitData2 = {'Ohio' : [3,0,2,1,7],'Colorado':[5,4,3,6,0]}
fruitFrame2 = DataFrame(fruitData2,columns =['Ohio','Colorado'],index = ['apple','orange','banana','cherry','mango']) 
print(fruitFrame1)
print(fruitFrame2)
fruitFrame1 + fruitFrame2

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
peer       5      3
        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

In [37]:
fruitSeries.sort_values(ascending=True)

peer      1200
apple     2500
banana    3800
cherry    6000
dtype: int64

In [38]:
fruitSeries.sort_index(ascending=True)

apple     2500
banana    3800
cherry    6000
peer      1200
dtype: int64

In [40]:
fruitFrame.sort_values(by=['fruitPrice', 'num'])

   fruitPrice  num fruitName  year  stock
3        1200    8      peer  2016    1.0
0        2500   10     apple  2016    4.0
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0